//数字经济分类中的一级分类
var c1 = [
    { code: '1', name: '01数字产品制造业' },
    { code: '2', name: '02数字产品服务业' },
    { code: '3', name: '03数字技术应用业' },
    { code: '4', name: '04数字要素驱动业' }
]

//数字经济分类中的二级分类

var c2 = [
    { code: 101, name: '计算机制造' },
    { code: 102, name: '通讯及雷达设备制造' },
    { code: 103, name: '数字媒体设备制造' },
    { code: 104, name: '智能设备制造' },
    { code: 105, name: '电子元器件及设备制造' },
    { code: 106, name: '其他数字产品制造业' },
    { code: 201, name: '数字产品批发' },
    { code: 202, name: '数字产品零售' },
    { code: 203, name: '数字产品租赁' },
    { code: 204, name: '数字产品维修' },
    { code: 205, name: '其他数字产品服务业' },
    { code: 301, name: '软件开发' },
    { code: 302, name: '电信、广播电视和卫星传输服务' },
    { code: 303, name: '互联网相关服务' },
    { code: 304, name: '信息技术服务' },
    { code: 305, name: '其他数字技术应用业' },
    { code: 401, name: '互联网平台' },
    { code: 402, name: '互联网批发零售' },
    { code: 403, name: '互联网金融' },
    { code: 404, name: '数字内容与媒体' },
    { code: 405, name: '信息基础设施建设' },
    { code: 406, name: '数据资源与产权交易' },
    { code: 407, name: '其他数字要素驱动业' },
    { code: 501, name: '智慧农业' },
    { code: 502, name: '智能制造' },
    { code: 503, name: '智能交通' },
    { code: 504, name: '智慧物流' },
    { code: 505, name: '数字金融' },
    { code: 506, name: '数字商贸' },
    { code: 507, name: '数字社会' },
    { code: 508, name: '数字政府' },
    { code: 509, name: '其他数字化效率提升业' }
]

var c3 = [
    {
        "code": 10101,
        "name": "计算机整机制造",
        "des": "指将可进行算术或逻辑运算的中央处理器和外围设备集成计算整机的制造，包括硬件与软件集成计算机系统的制造、来件组装计算机的加工",
        "industry": [
            {
                "code": "3911",
                "name": "计算机整机制造"
            }
        ]
    },
    {
        "code": 10102,
        "name": "计算机零部件制造",
        "des": "指组成电子计算机的内存、板卡、硬盘、电源、机箱、显示器等部件的制造",
        "industry": [
            {
                "code": "3912",
                "name": "计算机零部件制造"
            }
        ]
    },
    {
        "code": 10103,
        "name": "计算机外围设备制造",
        "des": "指计算机外围设备及附属设备的制造，包括输入设备、输出设备和外存储设备等制造",
        "industry": [
            {
                "code": "3913",
                "name": "计算机外围设备制造"
            }
        ]
    },
    {
        "code": 10104,
        "name": "工业控制计算机及系统制造",
        "des": "指一种采用总线结构，对生产过程及机电设备、工艺装备进行检测与控制的工具总称；工控机具有重要的计算机属性和特征，如具有计算机CPU、硬盘、内存、外设及接口，并有操作系统、控制网络和协议、计算能力、友好的人机界面；工控行业的产品和技术非常特殊，属于中间产品，是为其他各行业提供可靠、嵌入式、智能化的工业计算机制造",
        "industry": [
            {
                "code": "3914",
                "name": "工业控制计算机及系统制造"
            }
        ]
    },
    {
        "code": 10105,
        "name": "信息安全设备制造",
        "des": "指用于保护网络和计算机中信息和数据安全的专用设备的制造，包括边界安全、通信安全、身份鉴别与访问控制、数据安全、基础平台、内容安全、评估审计与监控、安全应用设备等制造",
        "industry": [
            {
                "code": "3915",
                "name": "信息安全设备制造"
            }
        ]
    },
    {
        "code": 10106,
        "name": "其他计算机制造",
        "des": "指计算机应用电子设备（以中央处理器为核心，配以专业功能模块、外围设备等构成各行业应用领域专用的电子产品及设备，如金融电子、汽车电子、医疗电子、信息采集及识别设备、数字化 3C 产品等），以及其他未列明计算机设备的制造",
        "industry": [
            {
                "code": "3919",
                "name": "其他计算机制造"
            }
        ]
    },
    {
        "code": 10201,
        "name": "通信系统设备制造",
        "des": "指固定或移动通信接入、传输、交换设备等通信系统建设所需设备的制造",
        "industry": [
            {
                "code": "3921",
                "name": "通信系统设备制造"
            }
        ]
    },
    {
        "code": 10202,
        "name": "通信终端设备制造",
        "des": "指固定或移动通信终端设备的制造",
        "industry": [
            {
                "code": "3922",
                "name": "通信终端设备制造"
            }
        ]
    },
    {
        "code": 10203,
        "name": "雷达及配套设备制造",
        "des": "指雷达整机及雷达配套产品的制造",
        "industry": [
            {
                "code": "3940",
                "name": "雷达及配套设备制造"
            }
        ]
    },
    {
        "code": 10301,
        "name": "广播电视节目制作及发射设备制造",
        "des": "指广播电视节目制作、发射设备及器材的制造",
        "industry": [
            {
                "code": "3931",
                "name": "广播电视节目制作及发射设备制造"
            }
        ]
    },
    {
        "code": 10302,
        "name": "广播电视接收设备制造",
        "des": "指专业广播电视接收设备的制造。不包括家用广播电视接收设备的制造",
        "industry": [
            {
                "code": "3932",
                "name": "广播电视接收设备制造"
            }
        ]
    },
    {
        "code": 10303,
        "name": "广播电视专用配件制造",
        "des": "指专业用录像重放及其他配套的广播电视设备的制造。不包括家用广播电视装置的制造",
        "industry": [
            {
                "code": "3933",
                "name": "广播电视专用配件制造"
            }
        ]
    },
    {
        "code": 10304,
        "name": "专业音响设备制造",
        "des": "指广播电视、影剧院、各种场地等专业用录音、音响设备及其他配套设备的制造",
        "industry": [
            {
                "code": "3934",
                "name": "专业音响设备制造"
            }
        ]
    },
    {
        "code": 10305,
        "name": "应用电视设备及其他广播电视设备制造",
        "des": "指应用电视设备、其他广播电视设备和器材的制造",
        "industry": [
            {
                "code": "3939",
                "name": "应用电视设备及其他广播电视设备制造"
            }
        ]
    },
    {
        "code": 10306,
        "name": "电视机制造",
        "des": "指非专业用电视机制造",
        "industry": [
            {
                "code": "3951",
                "name": "电视机制造"
            }
        ]
    },
    {
        "code": 10307,
        "name": "音响设备制造",
        "des": "指非专业用智能音响、无线电收音机、收录音机、唱机等音响设备的制造",
        "industry": [
            {
                "code": "3952",
                "name": "音响设备制造"
            }
        ]
    },
    {
        "code": 10308,
        "name": "影视录放设备制造",
        "des": "指非专业用智能机顶盒、录像机、摄像机、激光视盘机等影视设备整机及零部件的制造，包括教学用影视设备的制造。不包括广播电视等专业影视设备的制造",
        "industry": [
            {
                "code": "3953",
                "name": "影视录放设备制造"
            }
        ]
    },
    {
        "code": 10401,
        "name": "工业机器人制造",
        "des": "指用于工业自动化领域的工业机器人的制造，如焊接专用机器人、喷涂机器人、工厂用物流机器人、机械式遥控操作装置（遥控机械手）等",
        "industry": [
            {
                "code": "3491",
                "name": "工业机器人制造"
            }
        ]
    },
    {
        "code": 10402,
        "name": "特殊作业机器人制造",
        "des": "指用于特殊性作业的机器人的制造，如水下、危险环境、高空作业、国防、科考、特殊搬运、农业等特殊作业机器人",
        "industry": [
            {
                "code": "3492",
                "name": "特殊作业机器人制造"
            }
        ]
    },
    {
        "code": 10403,
        "name": "智能照明器具制造",
        "des": "指利用计算机、无线通讯数据传输、扩频电力载波通讯技术、计算机智能化信息处理及节能型电器控制等技术组成的分布式无线遥测、遥控、遥讯控制系统，具有灯光亮度的强弱调节、灯光软启动、定时控制、场景设置等功能的照明器具的制造",
        "industry": [
            {
                "code": "3874",
                "name": "智能照明器具制造"
            }
        ]
    },
    {
        "code": 10404,
        "name": "可穿戴智能设备制造",
        "des": "指由用户穿戴和控制，并且自然、持续地运行和交互的个人移动计算设备产品的制造，包括可穿戴运动监测设备的制造",
        "industry": [
            {
                "code": "3961",
                "name": "可穿戴智能设备制造"
            }
        ]
    },
    {
        "code": 10405,
        "name": "智能车载设备制造",
        "des": "指包含具备汽车联网、自动驾驶、车内及车际通讯、智能交通基础设施通信等功能要素，融合了传感器、雷达、卫星定位、导航、人工智能等技术，使汽车具备智能环境感知能力，自动分析汽车行驶的安全及危险状态目的的车载终端产品及相关配套设备的制造",
        "industry": [
            {
                "code": "3962",
                "name": "智能车载设备制造"
            }
        ]
    },
    {
        "code": 10406,
        "name": "智能无人飞行器制造",
        "des": "指按照国家有关安全规定标准，经允许生产并主要用于娱乐、科普等领域的智能无人飞行器的制造",
        "industry": [
            {
                "code": "3963",
                "name": "智能无人飞行器制造"
            }
        ]
    },
    {
        "code": 10407,
        "name": "服务消费机器人制造",
        "des": "指除工业和特殊作业以外的各种机器人的制造，包括用于个人、家庭及商业服务类机器人，如家务机器人、餐饮用机器人、宾馆用机器人、销售用机器人、娱乐机器人、助老助残机器人、医疗机器人、清洁机器人等",
        "industry": [
            {
                "code": "3964",
                "name": "服务消费机器人制造"
            }
        ]
    },
    {
        "code": 10408,
        "name": "其他智能消费设备制造",
        "des": "指其他未列明的智能消费设备的制造",
        "industry": [
            {
                "code": "3969",
                "name": "其他智能消费设备制造"
            }
        ]
    },
    {
        "code": 10501,
        "name": "半导体器件专用设备制造",
        "des": "指生产集成电路、二极管（含发光二极管）、三极管、太阳能电池片的设备的制造",
        "industry": [
            {
                "code": "3562",
                "name": "半导体器件专用设备制造"
            }
        ]
    },
    {
        "code": 10502,
        "name": "电子元器件与机电组件设备制造",
        "des": "指生产电容、电阻、电感、印制电路板、电声元件、锂离子电池等电子元器件与机电组件的设备的制造",
        "industry": [
            {
                "code": "3563",
                "name": "电子元器件与机电组件设备制造"
            }
        ]
    },
    {
        "code": 10503,
        "name": "电力电子元器件制造",
        "des": "指用于电能变换和控制（从而实现运动控制）的电子元器件的制造",
        "industry": [
            {
                "code": "3824",
                "name": "电力电子元器件制造"
            }
        ]
    },
    {
        "code": 10504,
        "name": "光伏设备及元器件制造",
        "des": "指太阳能组件（太阳能电池）、控制设备及其他太阳能设备和元器件制造。不包括太阳能用蓄电池制造",
        "industry": [
            {
                "code": "3825",
                "name": "光伏设备及元器件制造"
            }
        ]
    },
    {
        "code": 10505,
        "name": "电气信号设备装置制造",
        "des": "指交通运输工具（如机动车、船舶、铁道车辆等）专用信号装置及各种电气音响或视觉报警、警告、指示装置的制造，以及其他电气声像信号装置的制造",
        "industry": [
            {
                "code": "3891",
                "name": "电气信号设备装置制造"
            }
        ]
    },
    {
        "code": 10506,
        "name": "电子真空器件制造",
        "des": "指电子热离子管、冷阴极管或光电阴极管及其他真空电子器件，以及电子管零件的制造",
        "industry": [
            {
                "code": "3971",
                "name": "电子真空器件制造"
            }
        ]
    },
    {
        "code": 10507,
        "name": "半导体分立器件制造",
        "des": "指各类半导体分立器件的制造",
        "industry": [
            {
                "code": "3972",
                "name": "半导体分立器件制造"
            }
        ]
    },
    {
        "code": 10508,
        "name": "集成电路制造",
        "des": "指单片集成电路、混合式集成电路的制造",
        "industry": [
            {
                "code": "3973",
                "name": "集成电路制造"
            }
        ]
    },
    {
        "code": 10509,
        "name": "显示器件制造",
        "des": "指基于电子手段呈现信息供视觉感受的器件及模组的制造，包括薄膜晶体管液晶显示器件（TN/STN-LCD、TFT-LCD）、场发射显示器件（FED）、真空荧光显示器件（VFD）、有机发光二极管显示器件（OLED）、等离子显示器件（PDP）、发光二极管显示器件（LED）、曲面显示器件以及柔性显示器件等",
        "industry": [
            {
                "code": "3974",
                "name": "显示器件制造"
            }
        ]
    },
    {
        "code": 10510,
        "name": "半导体照明器件制造",
        "des": "指用于半导体照明的发光二极管（LED）、有机发光二极管（OLED）等器件的制造",
        "industry": [
            {
                "code": "3975",
                "name": "半导体照明器件制造"
            }
        ]
    },
    {
        "code": 10511,
        "name": "光电子器件制造",
        "des": "指利用半导体光—电子（或电—光子）转换效应制成的各种功能器件的制造",
        "industry": [
            {
                "code": "3976",
                "name": "光电子器件制造"
            }
        ]
    },
    {
        "code": 10512,
        "name": "电阻电容电感元件制造",
        "des": "指电容器（包括超级电容器）、电阻器、电位器、电感器件、电子变压器件的制造",
        "industry": [
            {
                "code": "3981",
                "name": "电阻电容电感元件制造"
            }
        ]
    },
    {
        "code": 10513,
        "name": "电子电路制造",
        "des": "指在绝缘基材上采用印制工艺形成电气电子连接电路，以及附有无源与有源元件的制造，包括印刷电路板及附有元器件构成电子电路功能组合件",
        "industry": [
            {
                "code": "3982",
                "name": "电子电路制造"
            }
        ]
    },
    {
        "code": 10514,
        "name": "敏感元件及传感器制造",
        "des": "指按一定规律，将感受到的信息转换成为电信号或其他所需形式的信息输出的敏感元件及传感器的制造",
        "industry": [
            {
                "code": "3983",
                "name": "敏感元件及传感器制造"
            }
        ]
    },
    {
        "code": 10515,
        "name": "电声器件及零件制造",
        "des": "指扬声器、送受话器、耳机、音箱等器件及零件的制造",
        "industry": [
            {
                "code": "3984",
                "name": "电声器件及零件制造"
            }
        ]
    },
    {
        "code": 10516,
        "name": "电子专用材料制造",
        "des": "指用于电子元器件、组件及系统制备的专用电子功能材料、互联与封装材料、工艺及辅助材料的制造，包括半导体材料、光电子材料、磁性材料、锂电池材料、电子陶瓷材料、覆铜板及铜箔材料、电子化工材料等",
        "industry": [
            {
                "code": "3985",
                "name": "电子专用材料制造"
            }
        ]
    },
    {
        "code": 10517,
        "name": "其他元器件及设备制造",
        "des": "指其他未列明的电子器件、电子元件、电子设备的制造",
        "industry": [
            {
                "code": "3979",
                "name": "其他电子器件制造"
            },
            {
                "code": "3989",
                "name": "其他电子元件制造"
            },
            {
                "code": "3990",
                "name": "其他电子设备制造"
            }
        ]
    },
    {
        "code": 10601,
        "name": "记录媒介复制",
        "des": "指将母带、母盘上的信息进行批量翻录的生产活动",
        "industry": [
            {
                "code": "2330",
                "name": "记录媒介复制"
            }
        ]
    },
    {
        "code": 10602,
        "name": "电子游戏游艺设备制造",
        "des": "指主要安装在室内游乐场所的电子游乐设备的制造，包括电子游戏机等",
        "industry": [
            {
                "code": "2462*",
                "name": "游艺用品及室内游艺器材制造"
            }
        ]
    },
    {
        "code": 10603,
        "name": "信息化学品制造",
        "des": "指电影、照相、幻灯、投影、医学和其他生产用感光材料、冲洗套药，磁、光记录材料，光纤维通讯用辅助材料，及其专用化学制剂的制造",
        "industry": [
            {
                "code": "2664",
                "name": "文化用信息化学品制造"
            }
        ]
    },
    {
        "industry": [
            {
                "code": "2665",
                "name": "医学生产用信息化学品制造"
            }
        ]
    },
    {
        "code": 10604,
        "name": "计算器及货币专用设备制造",
        "des": "指金融、商业、交通及办公等使用的电子计算器、具有计算功能的数据记录、重现和显示机器的制造，以及货币专用设备及类似机械的制造",
        "industry": [
            {
                "code": "3475",
                "name": "计算器及货币专用设备制造"
            }
        ]
    },
    {
        "code": 10605,
        "name": "增材制造装备制造",
        "des": "指以增材制造（3D打印）技术进行加工的设备制造和零部件制造",
        "industry": [
            {
                "code": "3493",
                "name": "增材制造装备制造"
            }
        ]
    },
    {
        "code": 10606,
        "name": "专用电线、电缆制造",
        "des": "指在声音、文字、图像等信息传播方面所使用的电线电缆的制造",
        "industry": [
            {
                "code": "3831*",
                "name": "电线、电缆制造"
            }
        ]
    },
    {
        "code": 10607,
        "name": "光纤制造",
        "des": "指将电的信号变成光的信号，进行声音、文字、图像等信息传输的光纤的制造",
        "industry": [
            {
                "code": "3832",
                "name": "光纤制造"
            }
        ]
    },
    {
        "code": 10608,
        "name": "光缆制造",
        "des": "指利用置于包覆套中的一根或多根光纤作为传输媒质并可以单独或成组使用的光缆的制造",
        "industry": [
            {
                "code": "3833",
                "name": "光缆制造"
            }
        ]
    },
    {
        "code": 10609,
        "name": "工业自动控制系统装置制造",
        "des": "指用于连续或断续生产制造过程中，测量和控制生产制造过程的温度、压力、流量、物位等变量或者物体位置、倾斜、旋转等参数的工业用计算机控制系统、检测仪表、执行机构和装置的制造",
        "industry": [
            {
                "code": "4011",
                "name": "工业自动控制系统装置制造"
            }
        ]
    },
    {
        "code": 20101,
        "name": "计算机、软件及辅助设备批发",
        "des": "指各类计算机、软件及辅助设备的批发和进出口活动",
        "industry": [
            {
                "code": "5176",
                "name": "计算机、软件及辅助设备批发"
            }
        ]
    },
    {
        "code": 20102,
        "name": "通讯设备批发",
        "des": "指各类电信设备的批发和进出口活动",
        "industry": [
            {
                "code": "5177",
                "name": "通讯设备批发"
            }
        ]
    },
    {
        "code": 20103,
        "name": "广播影视设备批发",
        "des": "指各类广播影视设备的批发和进出口活动",
        "industry": [
            {
                "code": "5178",
                "name": "广播影视设备批发"
            }
        ]
    },
    {
        "code": 20201,
        "name": "计算机、软件及辅助设备零售",
        "des": "指各类计算机、软件及辅助设备的零售活动",
        "industry": [
            {
                "code": "5273",
                "name": "计算机、软件及辅助设备零售"
            }
        ]
    },
    {
        "code": 20202,
        "name": "通信设备零售",
        "des": "指各类电信设备的零售活动",
        "industry": [
            {
                "code": "5274",
                "name": "通信设备零售"
            }
        ]
    },
    {
        "code": 20203,
        "name": "音像制品、电子和数字出版物零售",
        "des": "指各类音像制品及电子出版物的零售活动",
        "industry": [
            {
                "code": "5244",
                "name": "音像制品、电子和数字出版物零售"
            }
        ]
    },
    {
        "code": 20301,
        "name": "计算机及通讯设备经营租赁",
        "des": "指各类计算机、通讯设备的租赁活动",
        "industry": [
            {
                "code": "7114",
                "name": "计算机及通讯设备经营租赁"
            }
        ]
    },
    {
        "code": 20302,
        "name": "音像制品出租",
        "des": "指各种音像制品的出租活动",
        "industry": [
            {
                "code": "7125",
                "name": "音像制品出租"
            }
        ]
    },
    {
        "code": 20401,
        "name": "计算机和辅助设备修理",
        "des": "指各类计算机和辅助设备的修理活动",
        "industry": [
            {
                "code": "8121",
                "name": "计算机和辅助设备修理"
            }
        ]
    },
    {
        "code": 20402,
        "name": "通讯设备修理",
        "des": "指电话机、传真机和手机等通讯设备的修理活动",
        "industry": [
            {
                "code": "8122",
                "name": "通讯设备修理"
            }
        ]
    },
    {
        "code": 20500,
        "name": "其他数字产品服务业",
        "des": "指其他未列明数字产品服务业",
        "industry": []
    },
    {
        "code": 30101,
        "name": "基础软件开发",
        "des": "指能够对硬件资源进行调度和管理、为应用软件提供运行支撑的软件的开发活动，包括操作系统、数据库、中间件、各类固件等",
        "industry": [
            {
                "code": "6511",
                "name": "基础软件开发"
            }
        ]
    },
    {
        "code": 30102,
        "name": "支撑软件开发",
        "des": "指软件开发过程中使用到的支撑软件开发的工具和集成环境、测试工具软件等的开发活动",
        "industry": [
            {
                "code": "6512",
                "name": "支撑软件开发"
            }
        ]
    },
    {
        "code": 30103,
        "name": "应用软件开发",
        "des": "指独立销售的面向应用需求和解决方案等软件的开发活动，包括通用软件、工业软件、行业软件、嵌入式应用软件等",
        "industry": [
            {
                "code": "6513",
                "name": "应用软件开发"
            }
        ]
    },
    {
        "code": 30104,
        "name": "其他软件开发",
        "des": "指其他未列明软件的开发活动，如平台软件、信息安全软件等",
        "industry": [
            {
                "code": "6519",
                "name": "其他软件开发"
            }
        ]
    },
    {
        "code": 30201,
        "name": "电信",
        "des": "指利用有线、无线的电磁系统或者光电系统，传送、发射或者接收语音、文字、数据、图像、视频以及其他任何形式信息的活动",
        "industry": [
            {
                "code": "6311",
                "name": "固定电信服务"
            },
            {
                "code": "6312",
                "name": "移动电信服务"
            },
            {
                "code": "6319",
                "name": "其他电信服务"
            }
        ]
    },
    {
        "code": 30202,
        "name": "广播电视传输服务",
        "des": "指利用有线广播电视网络及其信息传输分发交换接入服务和信号，以及利用无线广播电视传输覆盖网及其信息传输分发交换服务信号的传输服务",
        "industry": [
            {
                "code": "6321",
                "name": "有线广播电视传输服务"
            },
            {
                "code": "6322",
                "name": "无线广播电视传输服务"
            }
        ]
    },
    {
        "code": 30203,
        "name": "卫星传输服务",
        "des": "指利用卫星提供通讯传输和广播电视传输服务，以及导航、定位、测绘、气象、地质勘查、空间信息等应用服务的活动",
        "industry": [
            {
                "code": "6331",
                "name": "广播电视卫星传输服务"
            },
            {
                "code": "6339",
                "name": "其他卫星传输服务"
            }
        ]
    },
    {
        "code": 30301,
        "name": "互联网接入及相关服务",
        "des": "指除基础电信运营商外，基于基础传输网络，为存储数据、数据处理及相关活动提供接入互联网的有关应用设施的服务活动",
        "industry": [
            {
                "code": "6410",
                "name": "互联网接入及相关服务"
            }
        ]
    },
    {
        "code": 30302,
        "name": "互联网搜索服务",
        "des": "指利用互联网查找、检索存储在其他站点上的信息的服务活动",
        "industry": [
            {
                "code": "6421",
                "name": "互联网搜索服务"
            }
        ]
    },
    {
        "code": 30303,
        "name": "互联网游戏服务",
        "des": "指各种互联网游戏服务活动，包括在线网络游戏、互联网电子竞技服务等",
        "industry": [
            {
                "code": "6422",
                "name": "互联网游戏服务"
            }
        ]
    },
    {
        "code": 30304,
        "name": "互联网资讯服务",
        "des": "指除基础电信运营商外，通过互联网提供网上新闻、网上新媒体、网上信息发布等信息服务的活动",
        "industry": [
            {
                "code": "8610*",
                "name": "新闻业"
            },
            {
                "code": "6429*",
                "name": "互联网其他信息服务"
            }
        ]
    },
    {
        "code": 30305,
        "name": "互联网安全服务",
        "des": "指各种互联网安全服务活动，包括网络安全集成服务、网络安全运维服务、网络安全灾备服务、网络安全监测和应急服务、网络安全认证检测服务、网络安全风险评估服务、网络安全咨询服务、网络安全培训服务等",
        "industry": [
            {
                "code": "6440",
                "name": "互联网安全服务"
            }
        ]
    },
    {
        "code": 30306,
        "name": "互联网数据服务",
        "des": "指以互联网技术为基础的大数据处理、云存储、云计算、云加工、区块链等服务活动",
        "industry": [
            {
                "code": "6450",
                "name": "互联网数据服务"
            }
        ]
    },
    {
        "code": 30307,
        "name": "其他互联网相关服务",
        "des": "指除基础电信运营商外，通过互联网提供网上音乐、网上视频、网上表演（直播）、网络动漫、网络艺术品等信息服务的活动，以及物联网服务、互联网资源写作服务、基于IPv6技术提供的网络平台服务等未列明的互联网服务活动。不包括互联网支付、互联网基金销售、互联网保险、互联网信托和互联网消费金融等互联网信息服务",
        "industry": [
            {
                "code": "6429*",
                "name": "互联网其他信息服务"
            },
            {
                "code": "6490",
                "name": "其他互联网服务"
            }
        ]
    },
    {
        "code": 30401,
        "name": "集成电路设计",
        "des": "指企业开展的集成电路功能研发、设计等服务活动",
        "industry": [
            {
                "code": "6520",
                "name": "集成电路设计"
            }
        ]
    },
    {
        "code": 30402,
        "name": "信息系统集成服务",
        "des": "指基于需方业务需求进行的信息系统需求分析和系统设计，并通过结构化的综合布缆系统、计算机网络技术和软件技术，将各个分离的设备、功能和信息等集成到相互关联的、统一和协调的系统之中，以及为信息系统的正常运行提供支持的服务活动",
        "industry": [
            {
                "code": "6531",
                "name": "信息系统集成服务"
            }
        ]
    },
    {
        "code": 30403,
        "name": "物联网技术服务",
        "des": "指提供各种物联网技术支持的服务活动，包括物联网信息感知技术服务、物联网信息传感技术服务、物联网数据通讯技术服务、物联网信息处理技术服务、物联网信息安全技术服务等",
        "industry": [
            {
                "code": "6532",
                "name": "物联网技术服务"
            }
        ]
    },
    {
        "code": 30404,
        "name": "运行维护服务",
        "des": "指各种运行维护服务活动，包括基础环境运行维护、网络运行维护、软件运行维护、硬件运行维护、局域网安装调试服务、局域网维护服务以及其他运行维护服务、网络技术支持服务等",
        "industry": [
            {
                "code": "6540",
                "name": "运行维护服务"
            }
        ]
    },
    {
        "code": 30405,
        "name": "信息处理和存储支持服务",
        "des": "指供方向需方提供的信息和数据的分析、整理、计算、编辑、存储等加工处理服务，以及应用软件、信息系统基础设施等租用服务，包括在线企业资源规划（ERP）、在线杀毒、服务器托管、虚拟主机等",
        "industry": [
            {
                "code": "6550",
                "name": "信息处理和存储支持服务"
            }
        ]
    },
    {
        "code": 30406,
        "name": "信息技术咨询服务",
        "des": "指在信息资源开发利用、工程建设、人员培训、管理体系建设、技术支撑等方面向需方提供的管理或技术咨询评估服务活动，包括信息化规划、信息技术管理咨询、信息系统工程监理、测试评估、信息技术培训等",
        "industry": [
            {
                "code": "6560",
                "name": "信息技术咨询服务"
            }
        ]
    },
    {
        "code": 30407,
        "name": "地理遥感信息及测绘地理信息服务",
        "des": "指各类地理遥感信息服务活动和遥感测绘服务活动，包括互联网地图服务软件、地理信息系统软件、测绘软件、遥感软件、导航与位置服务软件、地图制图软件等地理遥感信息服务，以及卫星定位测量、导航定位服务等遥感测绘服务",
        "industry": [
            {
                "code": "6571",
                "name": "地理遥感信息服务"
            },
            {
                "code": "7441",
                "name": "遥感测绘服务"
            },
            {
                "code": "7449",
                "name": "其他测绘地理信息服务"
            }
        ]
    },
    {
        "code": 30408,
        "name": "动漫、游戏及其他数字内容服务",
        "des": "指将动漫和游戏中的图片、文字、视频、音频等信息内容运用数字化技术进行加工、处理、制作并整合应用的服务活动，以及数字文化、数字体育等其他数字内容服务",
        "industry": [
            {
                "code": "6572",
                "name": "动漫、游戏数字内容服务"
            },
            {
                "code": "6579",
                "name": "其他数字内容服务"
            }
        ]
    },
    {
        "code": 30409,
        "name": "其他信息技术服务业",
        "des": "指其他上述未列明的信息技术服务业，包括电信呼叫服务、电话信息服务、计算机使用服务等",
        "industry": [
            {
                "code": "6591",
                "name": "呼叫中心"
            },
            {
                "code": "6599",
                "name": "其他未列明信息技术服务业"
            }
        ]
    },
    {
        "code": 30501,
        "name": "三维（3D）打印技术推广服务",
        "des": "指各类三维（3D）打印技术推广服务活动，包括3D打印服务、3D打印技术推广等",
        "industry": [
            {
                "code": "7517",
                "name": "三维（3D）打印技术推广服务"
            }
        ]
    },
    {
        "code": 30502,
        "name": "其他未列明数字技术应用业",
        "des": "指其他未列明的数字技术应用业",
        "industry": []
    },
    {
        "code": 40101,
        "name": "互联网生产服务平台",
        "des": "指专门为生产服务提供第三方服务平台的互联网活动，包括工业互联网平台、互联网大宗商品交易平台、互联网货物运输平台等",
        "industry": [
            {
                "code": "6431",
                "name": "互联网生产服务平台"
            }
        ]
    },
    {
        "code": 40102,
        "name": "互联网生活服务平台",
        "des": "指专门为居民生活服务提供第三方服务平台的互联网活动，包括互联网销售平台、互联网约车服务平台、在线旅游经营服务平台、互联网体育平台、互联网教育平台、互联网社交平台等",
        "industry": [
            {
                "code": "6432",
                "name": "互联网生活服务平台"
            }
        ]
    },
    {
        "code": 40103,
        "name": "互联网科技创新平台",
        "des": "指专门为科技创新、创业等提供第三方服务平台的互联网活动，包括网络众创平台、网络众包平台、网络众扶平台、技术创新网络平台、科技成果网络推广平台、知识产权交易平台、开源社区平台等",
        "industry": [
            {
                "code": "6433",
                "name": "互联网科技创新平台"
            }
        ]
    },
    {
        "code": 40104,
        "name": "互联网公共服务平台",
        "des": "指专门为公共服务提供第三方服务平台的互联网活动，包括互联网政务平台、互联网公共安全服务平台、互联网环境保护平台、互联网数据平台等",
        "industry": [
            {
                "code": "6434",
                "name": "互联网公共服务平台"
            }
        ]
    },
    {
        "code": 40105,
        "name": "其他互联网平台",
        "des": "指其他未列明的互联网平台",
        "industry": [
            {
                "code": "6439",
                "name": "其他互联网平台"
            }
        ]
    },
    {
        "code": 40201,
        "name": "互联网批发",
        "des": "指批发商主要通过互联网电子商务平台开展的商品批发活动",
        "industry": [
            {
                "code": "5193",
                "name": "互联网批发"
            }
        ]
    },
    {
        "code": 40202,
        "name": "互联网零售",
        "des": "指零售商通过电子商务平台开展的零售活动。不包括仅提供网络支付的活动，以及仅建立或提供网络交易平台和接入的活动",
        "industry": [
            {
                "code": "5292",
                "name": "互联网零售"
            }
        ]
    },
    {
        "code": 40301,
        "name": "网络借贷服务",
        "des": "指依法成立，专门从事网络借贷信息中介业务活动的金融信息中介公司通过互联网平台实现的直接借贷活动",
        "industry": [
            {
                "code": "6637",
                "name": "网络借贷服务"
            }
        ]
    },
    {
        "code": 40302,
        "name": "非金融机构支付服务",
        "des": "指非金融机构在收付款人之间作为中介机构提供的货币资金转移服务，包括第三方支付机构从事的互联网支付、预付卡的发行与受理、银行卡收单以及中国人民银行确定的其他支付等服务",
        "industry": [
            {
                "code": "6930",
                "name": "非金融机构支付服务"
            }
        ]
    },
    {
        "code": 40303,
        "name": "金融信息服务",
        "des": "指向从事金融分析、金融交易、金融决策或者其他金融活动的用户提供可能影响金融市场的信息（或者金融数据）的服务，包括征信机构服务",
        "industry": [
            {
                "code": "6940",
                "name": "金融信息服务"
            }
        ]
    },
    {
        "code": 40401,
        "name": "广播",
        "des": "指广播节目的现场制作、播放及其他相关活动，包括互联网广播",
        "industry": [
            {
                "code": "8710",
                "name": "广播"
            }
        ]
    },
    {
        "code": 40402,
        "name": "电视",
        "des": "指有线和无线电视节目的现场制作、播放及其他相关活动，包括互联网电视",
        "industry": [
            {
                "code": "8720",
                "name": "电视"
            }
        ]
    },
    {
        "code": 40403,
        "name": "影视节目制作",
        "des": "指电影、电视、录像（含以磁带、光盘为载体）和网络节目的制作活动，以及影视节目的后期制作。不包括电视台制作节目的活动",
        "industry": [
            {
                "code": "8730",
                "name": "影视节目制作"
            }
        ]
    },
    {
        "code": 40404,
        "name": "广播电视集成播控",
        "des": "指交互式网络电视（IPTV）、手机电视、互联网电视（OTT）等专网及定向传播视听节目服务的集成播控活动",
        "industry": [
            {
                "code": "8740",
                "name": "广播电视集成播控"
            }
        ]
    },
    {
        "code": 40405,
        "name": "电影和广播电视节目发行",
        "des": "指电影和影视节目的发行活动。不包括录像制品（以磁带、光盘为载体）的发行",
        "industry": [
            {
                "code": "8750",
                "name": "电影和广播电视节目发行"
            }
        ]
    },
    {
        "code": 40406,
        "name": "电影放映",
        "des": "指专业电影院以及设在娱乐场所独立（或相对独立）的电影放映等活动",
        "industry": [
            {
                "code": "8760",
                "name": "电影放映"
            }
        ]
    },
    {
        "code": 40407,
        "name": "录音制作",
        "des": "指可以在广播电台播放，或者制作成出版、销售的原版录音带（磁带或光盘），或者在其他宣传场合播放的录音节目的制作活动。不包括广播电台制作节目的活动",
        "industry": [
            {
                "code": "8770",
                "name": "录音制作"
            }
        ]
    },
    {
        "code": 40408,
        "name": "数字内容出版",
        "des": "指各类录音制品、电子出版物，以及利用数字技术进行内容编辑加工、并通过网络传播数字内容产品的出版服务",
        "industry": [
            {
                "code": "8624",
                "name": "音像制品出版"
            },
            {
                "code": "8625",
                "name": "电子出版物出版"
            },
            {
                "code": "8626",
                "name": "数字出版"
            }
        ]
    },
    {
        "code": 40409,
        "name": "数字广告",
        "des": "指在互联网平台投放，以广告横幅、文本链接、多媒体等形式，为外部客户提供宣传推广服务的活动",
        "industry": [
            {
                "code": "7251",
                "name": "互联网广告服务"
            }
        ]
    },
    {
        "code": 40501,
        "name": "网络基础设施建设",
        "des": "指光缆、微波、卫星、移动通信、工业互联网、物联网、5G等网络基础设施的建设活动",
        "industry": [
            {
                "code": "4851*",
                "name": "架线及设备工程建筑"
            },
            {
                "code": "4910*",
                "name": "电气安装"
            }
        ]
    },
    {
        "code": 40502,
        "name": "新技术基础设施建设",
        "des": "指人工智能、云计算、区块链等新技术基础设施的建设活动",
        "industry": [
            {
                "code": "4851*",
                "name": "架线及设备工程建筑"
            },
            {
                "code": "4910*",
                "name": "电气安装"
            }
        ]
    },
    {
        "code": 40503,
        "name": "算力基础设施建设",
        "des": "指以数据服务器、运算中心、数据存储阵列等为核心，实现数据信息的计算、存储、传递、加速、展示等功能的数据中心、智能计算中心等算力基础设施的建设活动",
        "industry": [
            {
                "code": "4790*",
                "name": "其他房屋建筑业"
            },
            {
                "code": "4851*",
                "name": "架线及设备工程建筑"
            },
            {
                "code": "4910*",
                "name": "电气安装"
            },
            {
                "code": "4999*",
                "name": "其他建筑安装"
            }
        ]
    },
    {
        "code": 40504,
        "name": "其他信息基础设施建设",
        "des": "指上述未列明的其他信息基础设施的建设活动",
        "industry": []
    },
    {
        "code": 40600,
        "name": "数据资源与产权交易",
        "des": "指对数据资源与数字产权的交易活动",
        "industry": [
            {
                "code": "7213*",
                "name": "资源与产权交易服务"
            }
        ]
    },
    {
        "code": 40701,
        "name": "供应链管理服务",
        "des": "指基于现代信息技术对供应链中的物流、商流、信息流和资金流进行设计、规划、控制和优化，将单一、分散的订单管理、采购执行、报关退税、物流管理、资金融通、数据管理、贸易商务、结算等一体化整合的服务",
        "industry": [
            {
                "code": "7224",
                "name": "供应链管理服务"
            }
        ]
    },
    {
        "code": 40702,
        "name": "安全系统监控服务",
        "des": "指各类安全系统监控服务活动，包括消防报警系统监控服务、治安报警系统监控服务、交通安全系统监控服务和其他安全系统监控服务。不包括公安部门的活动和消防部门的活动",
        "industry": [
            {
                "code": "7272",
                "name": "安全系统监控服务"
            }
        ]
    },
    {
        "code": 40703,
        "name": "数字技术研究和试验发展",
        "des": "指大数据、互联网、物联网、人工智能、VR/AR、边缘计算、异构计算、工业视觉算法等新兴计算关键技术，SDN（软件定义网络）、网络切片等关键技术研究应用，以及量子通信和其他数字技术的研发与试验发展活动",
        "industry": [
            {
                "code": "7320*",
                "name": "工程和技术研究和试验发展"
            }
        ]
    },
    {
        "code": 50101,
        "name": "数字化设施种植",
        "des": "指精准播种、智能温室等利用遥感、地理信息系统、全球定位系统、物联网、人工智能、大数据、云计算、无人机等现代信息技术和智能化设施，对土壤、地形、地貌、温度、湿度等农作物生长环境信息进行采集、分析，实现精准控制和监测的农作物种植及相关活动",
        "industry": [
            {
                "code": "01*",
                "name": "农业"
            }
        ]
    },
    {
        "code": 50102,
        "name": "数字林业",
        "des": "指利用遥感、地理信息系统、全球定位系统、物联网、无人机等现代信息技术和智能化设施，对土壤、地形、地貌、气候、温度、湿度等林业生长环境信息进行采集、分析，实现自动化、智能化的林业及相关活动",
        "industry": [
            {
                "code": "02*",
                "name": "林业"
            }
        ]
    },
    {
        "code": 50103,
        "name": "自动化养殖",
        "des": "指利用RFID射频识别、自动进食、人工智能、大数据、云计算等现代信息技术，实现自动化、智能化的畜牧业及相关活动，包括牲畜饲养、家禽饲养、水产养殖、畜禽粪污处理等活动",
        "industry": [
            {
                "code": "03*",
                "name": "畜牧业"
            }
        ]
    },
    {
        "industry": [
            {
                "code": "04*",
                "name": "渔业"
            }
        ]
    },
    {
        "code": 50104,
        "name": "新技术育种",
        "des": "指应用数字化、信息化、智能化等手段开展的种子种苗培育、林木育种育苗、畜牧良种繁殖、鱼苗及育种场等活动",
        "industry": [
            {
                "code": "0211*",
                "name": "林木育种"
            },
            {
                "code": "0212*",
                "name": "林木育苗"
            },
            {
                "code": "0511*",
                "name": "种子种苗培育活动"
            },
            {
                "code": "0531*",
                "name": "畜牧良种繁殖活动"
            },
            {
                "code": "0541*",
                "name": "鱼苗及鱼种场活动"
            }
        ]
    },
    {
        "code": 50105,
        "name": "其他智慧农业",
        "des": "指利用物联网、大数据、互联网等现代信息技术对农林牧渔业生产经营进行管理的活动",
        "industry": [
            {
                "code": "05*",
                "name": "农、林、牧、渔专业及辅助性活动"
            }
        ]
    },
    {
        "code": 50201,
        "name": "数字化通用、专用设备制造",
        "des": "指利用数字孪生、人工智能、5G、区块链、VR/AR、边缘计算、试验验证、仿真技术等技术和设备，在通用、专用设备领域开展的生产和制造活动，包括个性定制、柔性制造等新模式。不包括计算器及货币专用设备制造、工业机器人制造、特殊作业机器人制造、增材制造装备制造、半导体器件专用设备制造、电子元器件与机电组件设备制造",
        "industry": [
            {
                "code": "34*",
                "name": "通用设备制造业"
            },
            {
                "code": "35*",
                "name": "专用设备制造业"
            }
        ]
    },
    {
        "code": 50202,
        "name": "数字化运输设备制造",
        "des": "指利用数字孪生、人工智能、5G、区块链、VR/AR、边缘计算、试验验证、仿真技术等技术和设备，在交通运输设备领域开展的生产和制造活动",
        "industry": [
            {
                "code": "36*",
                "name": "汽车制造业"
            },
            {
                "code": "37*",
                "name": "铁路、船舶、航空航天和其他运输设备制造业"
            }
        ]
    },
    {
        "code": 50203,
        "name": "数字化电气机械、器材和仪器仪表制造",
        "des": "指利用数字孪生、人工智能、5G、区块链、VR/AR、边缘计算、试验验证、仿真技术等技术和设备，在电气机械和器材制造、仪器仪表领域开展的生产和制造活动。不包括电力电子元器件制造、光伏设备及元器件制造、专用电线电缆制造、光纤制造、光缆制造、智能照明器具制造、电气信号设备装置制造、工业自动控制系统装置制造",
        "industry": [
            {
                "code": "38*",
                "name": "电气机械和器材制造业"
            },
            {
                "code": "40*",
                "name": "仪器仪表制造业"
            }
        ]
    },
    {
        "code": 50204,
        "name": "其他智能制造",
        "des": "指利用数字孪生、人工智能、5G、区块链、VR/AR、边缘计算、试验验证、仿真技术等技术和设备，在上述未列明的制造行业开展的生产和制造活动",
        "industry": [
            {
                "code": "C*",
                "name": "制造业"
            }
        ]
    },
    {
        "code": 50301,
        "name": "智能铁路运输",
        "des": "指借助数字化技术和互联网平台进行的铁路安全管理、调度指挥、行车组织、客运组织、货运组织，以及机车车辆、线桥隧涵、牵引供电、通信信号、信息系统的运用及维修养护等活动",
        "industry": [
            {
                "code": "53*",
                "name": "铁路运输业"
            }
        ]
    },
    {
        "code": 50302,
        "name": "智能道路运输",
        "des": "指借助数字化技术和互联网平台进行的道路运输、经营及运输维护活动，包括公路智能管理、交通信号联动、公交优先通行控制、智慧停车场等",
        "industry": [
            {
                "code": "54*",
                "name": "道路运输业"
            }
        ]
    },
    {
        "code": 50303,
        "name": "智能水上运输",
        "des": "指借助数字化技术和互联网平台进行的水上旅客运输、水上货物运输和水上运输辅助活动，包括智慧港口、数字航道等",
        "industry": [
            {
                "code": "55*",
                "name": "水上运输业"
            }
        ]
    },
    {
        "code": 50304,
        "name": "智能航空运输",
        "des": "指借助数字化技术和互联网平台进行的航空客货运输、通用航空服务和航空运输辅助活动，包括智慧民航等",
        "industry": [
            {
                "code": "56*",
                "name": "航空运输业"
            }
        ]
    },
    {
        "code": 50305,
        "name": "其他智能交通",
        "des": "指借助数字化技术和互联网平台进行的海底管道运输和陆地管道运输活动，以及由两种及以上的交通工具相互衔接、转运而共同完成的货物复合运输活动以及与运输有关的代理及服务活动",
        "industry": [
            {
                "code": "57*",
                "name": "管道运输业"
            },
            {
                "code": "58*",
                "name": "多式联运和运输代理业"
            }
        ]
    },
    {
        "code": 50401,
        "name": "智慧仓储",
        "des": "指以信息化技术为依托的装卸搬运、仓储服务",
        "industry": [
            {
                "code": "59*",
                "name": "装卸搬运和仓储业"
            }
        ]
    },
    {
        "code": 50402,
        "name": "智慧配送",
        "des": "指利用信息化技术开展的邮政、快递服务",
        "industry": [
            {
                "code": "60*",
                "name": "邮政业"
            }
        ]
    },
    {
        "code": 50501,
        "name": "银行金融服务",
        "des": "指银行提供的发放贷款、理财、监管等服务活动，包括中央银行服务、货币银行服务、非货币银行服务、银行理财服务和银行监管服务。不包括典当和网络借贷服务",
        "industry": [
            {
                "code": "66*",
                "name": "货币金融服务"
            }
        ]
    },
    {
        "code": 50502,
        "name": "数字资本市场服务",
        "des": "指借助数字化技术和互联网平台进行的资本融通与交易市场的服务，包括证券市场服务、公开募集证券投资基金、非公开募集证券投资基金、期货市场服务、证券期货监管服务、资本投资服务，以及上述未列明的其他资本市场服务",
        "industry": [
            {
                "code": "67*",
                "name": "资本市场服务"
            }
        ]
    },
    {
        "code": 50503,
        "name": "互联网保险",
        "des": "指保险机构依托互联网订立保险合同、提供保险服务的保险经营活动",
        "industry": [
            {
                "code": "68*",
                "name": "保险业"
            }
        ]
    },
    {
        "code": 50504,
        "name": "其他数字金融",
        "des": "指上述未列明的其他金融业。不包括非金融机构支付服务、金融信息服务",
        "industry": [
            {
                "code": "69*",
                "name": "其他金融业"
            }
        ]
    },
    {
        "code": 50601,
        "name": "数字化批发",
        "des": "指在商品流通环节中有数字化技术适度参与的批发活动。不包括主要通过互联网电子商务平台开展的商品批发活动",
        "industry": [
            {
                "code": "51*",
                "name": "批发业"
            }
        ]
    },
    {
        "code": 50602,
        "name": "数字化零售",
        "des": "指在商品流通环节中有数字化技术适度参与的零售活动，包括无人店铺零售、新零售等。不包括主要通过互联网电子商务平台开展的商品零售活动",
        "industry": [
            {
                "code": "52*",
                "name": "零售业"
            }
        ]
    },
    {
        "code": 50603,
        "name": "数字化住宿",
        "des": "指利用信息化技术开展的高效、精准、便捷的现代住宿活动",
        "industry": [
            {
                "code": "61*",
                "name": "住宿业"
            }
        ]
    },
    {
        "code": 50604,
        "name": "数字化餐饮",
        "des": "指利用信息化技术开展的高效、精准、便捷的现代餐饮活动",
        "industry": [
            {
                "code": "62*",
                "name": "餐饮业"
            }
        ]
    },
    {
        "code": 50605,
        "name": "数字化租赁",
        "des": "指利用信息化技术开展的租赁活动。不包括计算机及通讯设备经营租赁、音像制品出租",
        "industry": [
            {
                "code": "71*",
                "name": "租赁业"
            }
        ]
    },
    {
        "code": 50606,
        "name": "数字化商务服务",
        "des": "指利用信息化技术开展的商务咨询与调查、票务代理服务、旅游、人力资源服务、会议展览及相关服务等活动。不包括资源与产权交易服务、供应链管理服务、互联网广告服务、安全系统监控服务",
        "industry": [
            {
                "code": "72*",
                "name": "商务服务业"
            }
        ]
    },
    {
        "code": 50701,
        "name": "智慧教育",
        "des": "指利用数字化技术和信息化平台进行内容传播和快速学习的活动，包括在线教育、在线培训、网络学院、网络教育和以在线学习等为主的互联网学校教育和职业技能培训等",
        "industry": [
            {
                "code": "83*",
                "name": "教育"
            }
        ]
    },
    {
        "code": 50702,
        "name": "智慧医疗",
        "des": "指利用数字化技术和信息化平台开展的医学检查检验影像，以及在线医疗、远程医疗等服务活动",
        "industry": [
            {
                "code": "84*",
                "name": "卫生"
            }
        ]
    },
    {
        "code": 50703,
        "name": "数字化社会工作",
        "des": "指利用数字化技术和信息化平台开展的慈善、救助、福利、护理、帮助等社会工作的活动",
        "industry": [
            {
                "code": "85*",
                "name": "社会工作"
            }
        ]
    },
    {
        "code": 50801,
        "name": "行政办公自动化",
        "des": "指各级行政机关应用现代信息技术、网络技术、计算机等进行的内部办公活动",
        "industry": [
            {
                "code": "S*",
                "name": "公共管理、社会保障和社会组织"
            }
        ]
    },
    {
        "code": 50802,
        "name": "网上税务办理",
        "des": "指税务部门通过互联网提供的税收缴纳服务和管理活动",
        "industry": [
            {
                "code": "9221*",
                "name": "综合事务管理机构"
            }
        ]
    },
    {
        "code": 50803,
        "name": "互联网海关服务",
        "des": "指海关通过互联网进行的通关管理、关税征收等活动",
        "industry": [
            {
                "code": "9221*",
                "name": "综合事务管理机构"
            }
        ]
    },
    {
        "code": 50804,
        "name": "网上社会保障服务",
        "des": "指社会保障部门通过互联网提供的各种社会保障服务，包括基本保险、补充保险及其他基本保险等",
        "industry": [
            {
                "code": "94*",
                "name": "社会保障"
            }
        ]
    },
    {
        "code": 50805,
        "name": "其他数字政府",
        "des": "指其他未列明的电子政务活动",
        "industry": [
            {
                "code": "S*",
                "name": "公共管理、社会保障和社会组织"
            }
        ]
    },
    {
        "code": 50901,
        "name": "数字采矿",
        "des": "指利用工业机器人、大数据、物联网、云技术等技术和设备开展煤炭、石油和天然气的开采、洗选、采选、分级等生产活动",
        "industry": [
            {
                "code": "B*",
                "name": "采矿业"
            }
        ]
    },
    {
        "code": 50902,
        "name": "智能化电力、热力、燃气及水生产和供应",
        "des": "指将大数据、物联网、云技术等技术和设备应用到电力、热力、燃气及水生产、处理、利用或供应活动中，实现生产、处理、利用或供应过程可视化智能实时监控预警等功能的生产活动",
        "industry": [
            {
                "code": "D*",
                "name": "电力、热力、燃气及水生产和供应业"
            }
        ]
    },
    {
        "code": 50903,
        "name": "数字化建筑业",
        "des": "指利用BIM技术、云计算、大数据、物联网、人工智能、移动互联网等数字技术与传统建筑业的融合活动",
        "industry": [
            {
                "code": "E*",
                "name": "建筑业"
            }
        ]
    },
    {
        "code": 50904,
        "name": "互联网房地产业",
        "des": "指利用互联网进行的房地产中介服务、房地产租赁经营，以及上述未列明的其他互联网房地产业",
        "industry": [
            {
                "code": "K*",
                "name": "房地产业"
            }
        ]
    },
    {
        "code": 50905,
        "name": "专业技术服务业数字化",
        "des": "指利用信息化技术，通过大数据、云计算等技术手段进行的专业技术服务，包括气象服务、地震服务、海洋服务、环境与生态监测检测服务、地质勘查、工程技术与设计服务及其他专业技术服务。不包括工程和技术研究和试验发展、测绘地理信息服务、三维（3D）打印技术推广服务",
        "industry": [
            {
                "code": "M*",
                "name": "科学研究和技术服务业"
            }
        ]
    },
    {
        "code": 50906,
        "name": "数字化水利、环境和市政设施管理",
        "des": "指通过信息技术和网络手段实现的水利、环境和公共设施管理，包括水利管理、公共设施管理、土地管理、生态保护和环境治理活动",
        "industry": [
            {
                "code": "N*",
                "name": "水利、环境和公共设施管理业"
            }
        ]
    },
    {
        "code": 50907,
        "name": "互联网居民生活服务",
        "des": "指利用信息化技术，通过互联网联络、承接业务、签单、付款等提供的家庭服务、托儿所服务、洗染服务、理发及美容服务、洗浴和保健养生服务、摄影扩印服务、婚姻服务、殡葬服务、代购服务、代驾服务、机动车和日用品修理服务、清洁服务等居民服务业。不包括计算机和辅助设备修理、通讯设备修理",
        "industry": [
            {
                "code": "O*",
                "name": "居民服务、修理和其他服务业"
            }
        ]
    },
    {
        "code": 50908,
        "name": "互联网文体娱乐业",
        "des": "指充分渗透数字化技术的文化体育和娱乐活动，包括数字博物馆、数字图书馆等利用数字化技术和信息化平台、借助数字化设备进行的文化艺术活动，专业从事体育比赛、训练、辅导和管理的组织所进行的活动，体育中介代理活动，以及各种形式的彩票活动。不包括新闻业、音像制品出版、电子出版物出版、数字出版",
        "industry": [
            {
                "code": "86*",
                "name": "新闻和出版业"
            },
            {
                "code": "88*",
                "name": "文化艺术业"
            },
            {
                "code": "89*",
                "name": "体育"
            },
            {
                "code": "90*",
                "name": "娱乐业"
            }
        ]
    }
]

console.log(data.length)